Revit 2024 API
AnalyticalLinkType.RotationY Property
 Fixity of rotation around Y.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public AnalyticalFixityState RotationY { get; set; }
Visual Basic
Public Property RotationY As AnalyticalFixityState
	Get
	Set
Visual C++
public:
property AnalyticalFixityState RotationY {
	AnalyticalFixityState get ();
	void set (AnalyticalFixityState value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The fixity state rotationY is not valid for Analytical Link Type parameters.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace